read_verilog /root/input/xor.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /root/output/xor_yosys
write_edif /root/output/xor.edif
write_json /root/output/xor.json
