read_verilog /root/input/and.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /root/output/and_yosys
write_edif /root/output/and.edif
write_json /root/output/and.json
