read_verilog /root/input/or.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /root/output/or_yosys
write_edif /root/output/or.edif
write_json /root/output/or.json
